1. Descubra as colunas qualitativas e quantitativas. 
1. Descreva os intervalos das colunas quantitativas. 
1. Calcule a media, mediana e moda de cada coluna quantitativa

In [113]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

### Carregando os dados

In [114]:
df = sns.load_dataset('titanic')
df.head(2)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False

In [115]:
df.shape

(891, 15)

### Infos sobre o DF:

In [116]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
survived       891 non-null int64
pclass         891 non-null int64
sex            891 non-null object
age            714 non-null float64
sibsp          891 non-null int64
parch          891 non-null int64
fare           891 non-null float64
embarked       889 non-null object
class          891 non-null category
who            891 non-null object
adult_male     891 non-null bool
deck           203 non-null category
embark_town    889 non-null object
alive          891 non-null object
alone          891 non-null bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.6+ KB

In [135]:
listadecolunas = list(df.describe().columns)
listadecolunas

['survived', 'pclass', 'age', 'sibsp', 'parch', 'fare']

In [139]:
for item in listadecolunas:
    print('{} Mediana: {} Moda: {} \n'.format(item, df[item].median(), df[item].mode()))

survived Mediana: 0.0 Moda: 0    0
dtype: int64

pclass Mediana: 3.0 Moda: 0    3
dtype: int64

age Mediana: 28.0 Moda: 0    24.0
dtype: float64

sibsp Mediana: 0.0 Moda: 0    0
dtype: int64

parch Mediana: 0.0 Moda: 0    0
dtype: int64

fare Mediana: 14.4542 Moda: 0    8.05
dtype: float64

In [118]:
print(df.isnull().values.sum())

869

In [119]:
df.select_dtypes(np.number)

     survived  pclass   age  sibsp  parch     fare
0           0       3  22.0      1      0   7.2500
1           1       1  38.0      1      0  71.2833
2           1       3  26.0      0      0   7.9250
3           1       1  35.0      1      0  53.1000
4           0       3  35.0      0      0   8.0500
..        ...     ...   ...    ...    ...      ...
886         0       2  27.0      0      0  13.0000
887         1       1  19.0      0      0  30.0000
888         0       3   NaN      1      2  23.4500
889         1       1  26.0      0      0  30.0000
890         0       3  32.0      0      0   7.7500

[891 rows x 6 columns]

In [120]:
df.select_dtypes(object)

        sex embarked    who  embark_town alive
0      male        S    man  Southampton    no
1    female        C  woman    Cherbourg   yes
2    female        S  woman  Southampton   yes
3    female        S  woman  Southampton   yes
4      male        S    man  Southampton    no
..      ...      ...    ...          ...   ...
886    male        S    man  Southampton    no
887  female        S  woman  Southampton   yes
888  female        S  woman  Southampton    no
889    male        C    man    Cherbourg   yes
890    male        Q    man   Queenstown    no

[891 rows x 5 columns]

In [153]:
test = df['survived'].value_counts()
type(test)
print(test.shape, test)
len(test)
a = df['survived'].dtype
print(a)

(2,) 0    549
1    342
Name: survived, dtype: int64
int64

In [122]:
testv = test.shape
if testv[0] == 2:
    print('ok')

ok

In [123]:
lista_de_col = list(df.columns)
print(lista_de_col)

['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare', 'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town', 'alive', 'alone']

### Funcao para verificar se a coluna e categorica e criar um novo DF

In [164]:
df2 = pd.DataFrame()
for i in range(0, len(lista_de_col)):
    if len(df[lista_de_col[i]].value_counts()) <= 3 or df[lista_de_col[i]].dtype == object:
        df2['Categoricas {}'.format(lista_de_col[i])] = df[lista_de_col[i]]
    if len(df[lista_de_col[i]].value_counts()) > 3 and df[lista_de_col[i]].dtype != object:
        df2['Quantitativas {}'.format(lista_de_col[i])] = df[lista_de_col[i]]

In [165]:
print(df2.shape)
df2.head()

(891, 15)

,Categoricas survived,Categoricas pclass,Categoricas sex,Quantitativas age,Quantitativas sibsp,Quantitativas parch,Quantitativas fare,Categoricas embarked,Categoricas class,Categoricas who,Categoricas adult_male,Quantitativas deck,Categoricas embark_town,Categoricas alive,Categoricas alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True